<script>
    import { stores } from "@sapper/app";
    const { page } = stores();
</script>

<svelte:head>
    <title>Справка</title>
</svelte:head>

<h1>Справка</h1>

<div>
    <a href="{$page.path}#about">О сайте</a>
</div>
<div>
    <a href="{$page.path}#termins">Термины</a>
</div>
<div>
    <a href="{$page.path}#categories">Категории мандельских аномалий</a>
</div>
<div>
    <a href="{$page.path}#links">Полезные ссылки</a>
</div>

<h2 id="about">О сайте</h2>

<h2 id="termins">Термины</h2>
<ul>
    <li>
        мандела (женского рода) - конкретный факт об изменении реальности.
        Названа в честь Нельсона Манделы.
    </li>
    <li>
        геомандела - то же, что и мандела, только в более узком смысле,
        относящаяся к категории изменений географических карт или ландшафтов.
    </li>
    <li>
        мандельщик - человек, подверженный действию эффекту Манделы, то есть
        тот, кто видит изменения, но при этом не считает, что это конфабуляции.
    </li>
    <li>
        остатки - материальные доказательства первоначального состояния факта до
        изменения, воспроизведённые человеком по памяти. Как правило, остатки
        делаются неосозанно, то есть или не зная, что факт уже изменился, или же
        создание остатка было выполнено ещё до изменения самого факта. Точный
        механизм возникновения остатков неизвестен.
    </li>
    <li>
        флип-флоп (англ. flip-flop; иногда называют "откат") - процесс, при
        котором изменение возвращается в первоначальное сотояние. То есть
        мандела исчезает, словно её и не было. Флип-флопы тоже иногда порождают
        свои остатки.
    </li>
    <li>
        манделиться - изменяться. При этом изменение оказывается в прошлом,
        словно оно всегда таким и было.
    </li>
</ul>

<h2 id="categories">Категории мандельских аномалий</h2>

<h2 id="links">Полезные ссылки</h2>
