<svelte:head>
    <title>Справка</title>
</svelte:head>

<h1>Справка</h1>

<h2>Термины</h2>
<ul>
    <li>
        мандела (женского рода) - факт об изменении реальности. Названа в честь
        Нельсона Манделы.
    </li>
    <li>
        геомандела - то же, что и мандела, только в более узком смысле,
        относящаяся к категории изменений географических карт или ландшафтов.
    </li>
    <li>
        остатки - материальные доказательства первоначального состояния факта до
        изменения, воспроизведённые человеком по памяти. Как правило, остатки
        делаются неосозанно, то есть или не зная, что факт уже изменился, или же
        создание остатка было выполнено ещё до изменения самого факта. Точный
        механизм возникновения остатков неизвестен.
    </li>
    <li>
        флип-флоп (англ. flip-flop) - процесс, при котором изменение
        возвращается в первоначальное сотояние. То есть мандела исчезает, словно
        бы её и не было. Флип-флопы тоже иногда порождают свои остатки.
    </li>
</ul>
