<script>
    import { stores } from "@sapper/app";
    const { page } = stores();
</script>

<svelte:head>
    <title>Справка</title>
</svelte:head>

<h1>Справка</h1>

<div>
    <a href="{$page.path}#about">О сайте</a>
</div>
<div>
    <a href="{$page.path}#termins">Термины</a>
</div>
<div>
    <a href="{$page.path}#categories">Категории мандельских аномалий</a>
</div>
<div>
    <a href="{$page.path}#rules">Рекомендуемые правила оформления мандел</a>
</div>
<div>
    <a href="{$page.path}#links">Полезные ссылки</a>
</div>

<h2 id="about">О сайте</h2>
Здесь собираются факты об изменениях реальности по версии конспирологов или
конфабуляции по версии учёных.
<h2 id="termins">Термины</h2>
<ul>
    <li>
        мандела (женского рода) - конкретный факт об изменении реальности.
        Названа в честь Нельсона Манделы.
    </li>
    <li>
        геомандела - то же, что и мандела, только в более узком смысле,
        относящаяся к категории изменений географических карт или ландшафтов.
    </li>
    <li>
        мандельщик - человек, подверженный действию эффекту Манделы, то есть
        тот, кто видит изменения, но при этом не считает, что это конфабуляции.
    </li>
    <li>
        остатки - материальные доказательства первоначального состояния факта до
        изменения, воспроизведённые человеком по памяти. Как правило, остатки
        делаются неосозанно, то есть или не зная, что факт уже изменился, или же
        создание остатка было выполнено ещё до изменения самого факта. Точный
        механизм возникновения остатков неизвестен.
    </li>
    <li>
        флип-флоп (англ. flip-flop; иногда называют "откат") - процесс, при
        котором изменение возвращается в первоначальное сотояние. То есть
        мандела исчезает, а большинство людей о ней забывают. Флип-флопы тоже
        иногда порождают свои остатки.
    </li>
    <li>
        манделиться - изменяться. При этом изменение оказывается в прошлом,
        словно оно всегда таким и было.
    </li>
</ul>

<h2 id="categories">Категории мандельских аномалий</h2>
Попытка систематизации наблюдаемых аномалий, выполненная Владимиром Зарыповым.
<ol>
    <li>Избирательность наблюдения.</li>
    <li>Временной разброс наблюдения.</li>
    <li>Фиксация только через память.</li>
    <li>Остатки.</li>
    <li>Неопределённость значимости.</li>
    <li>Флип-флоп.</li>
    <li>Локальные замены.</li>
    <li>Глобальные замены.</li>
    <li>Ротация авторов произведений.</li>
    <li>Увеличение детализации.</li>
    <li>Новые животные и растения.</li>
    <li>Современные слова в Библии KJV.</li>
    <li>Воскрешение мёртвых.</li>
    <li>Сдвиг исторических событий.</li>
    <li>Повторение событий.</li>
    <li>Волнообразность.</li>
    <li>Отсутствие последствий.</li>
    <li>Расщепление.</li>
</ol>
<a href="https://mandelafx.livejournal.com/906.html">Подробное описание</a>

<h2 id="rules">Рекомендуемые правила оформления мандел</h2>

<ol>
    <li>
        В заголовке пишите о новой версии описываемого вами факта с целью
        привлечения внимания тех, кто увидит новую версию впервые.
        <h4>Пример</h4>
        <p>Мандела умер в 2013 году.</p>
        <p>В моём доме не выражаться.</p>
    </li>
    <li>
        В описании предоставьте дополнительную информацию о факте. Опишите как
        старую версию, так и новую.
    </li>
    <h4>Пример</h4>
    <p>
        Мандела умер в тюрьме в ЮАР в начале 90-х годов. Однако теперь он
        остался жив, вышел из тюрьмы, стал президентом ЮАР и умер в глубкой
        старости в 2013 году.
    </p>
    <li>
        Снабдите ваши пояснения изображениями. Можете показать факт в новом
        состоянии.
        <h4>Пример</h4>
        <p>Фото дожившего до седин Манделы.</p>
        А также остатки, подтверждающие, что ваша версия не выдумана.
        <h4>Пример</h4>
        <p>
            Скан старой газеты, где написано о смерти Манделы в 90-х годах. Либо
            воспоминания других людей, описывающих похороны и траур по Манделе
            на весь СССР.
        </p>
    </li>
    <li>
        Если манделу можно посмотреть на видео, то добавьте ролик с YouTube,
        демонстрирующий новую версию (старой на видео вы уже не найдёте).
        <h4>Пример</h4>
        <p>
            Речь Ельцина, где вместо "Я устал, я ухожу" он говорит "Я ухожу. Я
            сделал, всё что мог".
        </p>
    </li>
    <li>
        Если тема вашей манделы уже была где-то подробно описана, то укажите
        ссылку на это описание.
        <h4>Пример</h4>
        <p>
            <a href="https://krre31.livejournal.com/39995.html">
                https://krre31.livejournal.com/39995.html
            </a>
        </p>
    </li>
    <li>
        Если вы нашли манделу в другом месте и точно знаете, что это место
        является первоисточником, и раньше о ней нигде не говорили, то также
        укажите ссылку на этот первоисточник, чтобы за вами потом не гонялись
        копирасты. Если мандела общеизвестная, то такую ссылку можно не
        указывать.
        <p />
    </li>
    <li>
        Все правила не являются обязательными. Если у вас творческий кризис, и
        вы не знаете, что писать о манделе, то и одного заголовка будет
        достаточно.
    </li>
</ol>

<h2 id="links">Полезные ссылки</h2>
